      *SEQ_2
       01  SEQ2_numA                   PIC Z(2) VALUE 10.
       01  SEQ2_numB                   PIC Z(2) VALUE 5.
       01  SEQ2_numC                   PIC Z(2).

      *SEQ_3
       01  SEQ3_NumberA                PIC 999999V99.
       01  SEQ3_A_OUT                  PIC ZZZ,ZZZ.ZZ.
       01  SEQ3_NumberB                PIC 999999V99.
       01  SEQ3_B_OUT                  PIC ZZZ,ZZZ.ZZ.
       01  SEQ3_SolvedDisplay          PIC ZZZ,ZZZ.99.

      *SEQ_4
       01  SEQ4_CELCIUS                PIC S9(5)v99.
       01  SEQ4_FAHRENHEIT             PIC S9(5)v99.
       01  SEQ4_F_OUT                  PIC ZZ,ZZZ.99.

      *SEQ_5
       01  SEQ5_SALES_MAN_NUM          PIC 9(12).
       01  SEQ5_SALES_MAN_NAME         PIC X(25).
       01  SEQ5_UNIT_SOLD              PIC 9(5).
       01  SEQ5_UNIT_PRICE             PIC 9(5)v99.
       01  SEQ5_STORE_TOTAL_SALES      PIC $ZZ,ZZ9.
